Enums/ТипАудитории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипАудитории</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лекционная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Компьютерная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипАудитории/Ext/ManagerModule.bsl
Функция ПолучитьПредполагаемыйТип(Строка) Экспорт
	НачалоСтроки = Лев(Строка, 2);
	
	Если СтрСравнить(НачалоСтроки, "ле") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Лекционная"];
		
	ИначеЕсли СтрСравнить(НачалоСтроки, "ла") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Лаборатория"];
		
	ИначеЕсли СтрСравнить(НачалоСтроки, "об") = 0
			ИЛИ СтрСравнить(НачалоСтроки, "се") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Обычная"];
		
	ИначеЕсли СтрСравнить(НачалоСтроки, "ко") = 0 Тогда
		Возврат Перечисления.ТипАудитории["Компьютерная"];
		
	Иначе
		Возврат Ложь;
		
	КонецЕсли;
КонецФункции
